tap "homebrew/bundle"
tap "oven-sh/bun"
brew "asdf"
brew "docker"
brew "fzf"
brew "gh"
brew "go"
brew "hasura-cli"
brew "httpie"
brew "nvm"
brew "pnpm"
brew "starship"
brew "stow"
brew "yarn"
brew "zsh-autocomplete"
brew "zsh-syntax-highlighting"
brew "oven-sh/bun/bun"
cask "1password"
cask "alacritty"
cask "alt-tab"
cask "another-redis-desktop-manager"
cask "appcleaner"
cask "arc"
cask "cleanshot"
cask "dbeaver-community"
cask "discord"
cask "docker"
cask "hiddenbar"
cask "httpie"
cask "iterm2"
cask "itsycal"
cask "lark"
cask "logi-options-plus"
cask "microsoft-edge"
cask "monitorcontrol"
cask "notion"
cask "notion-calendar"
cask "slack"
cask "spotify"
cask "stats"
cask "via"
cask "visual-studio-code"
cask "warp"
cask "whatsapp"
vscode "ansub.enchant"
vscode "astro-build.astro-vscode"
vscode "aykutsarac.jsoncrack-vscode"
vscode "be5invis.toml"
vscode "blanu.vscode-styled-jsx"
vscode "bradlc.vscode-tailwindcss"
vscode "cardinal90.multi-cursor-case-preserve"
vscode "catppuccin.catppuccin-vsc"
vscode "chenjie.fleet-dark"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "digitalbrainstem.javascript-ejs-support"
vscode "dionannd.tokyo-night-ported-nvim"
vscode "donjayamanne.githistory"
vscode "drcika.apc-extension"
vscode "drewxs.tokyo-night-dark"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "euskadi31.json-pretty-printer"
vscode "file-icons.file-icons"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "grapecity.gc-excelviewer"
vscode "jinliming2.vscode-go-template"
vscode "josemurilloc.aura-spirit-dracula"
vscode "kevinrose.vsc-python-indent"
vscode "lokalise.i18n-ally"
vscode "magicstack.magicpython"
vscode "mechatroner.rainbow-csv"
vscode "meganrogge.template-string-converter"
vscode "mhutchie.git-graph"
vscode "miguelsolorio.min-theme"
vscode "miguelsolorio.symbols"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.makefile-tools"
vscode "ms-vsliveshare.vsliveshare"
vscode "mvllow.rose-pine"
vscode "naumovs.color-highlight"
vscode "obstinate.vesper-pp"
vscode "pkief.material-icon-theme"
vscode "pmndrs.pmndrs"
vscode "postman.postman-for-vscode"
vscode "raunofreiberg.vesper"
vscode "redhat.java"
vscode "ritwickdey.liveserver"
vscode "rvest.vs-code-prettier-eslint"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "supermaven.supermaven"
vscode "tamasfe.even-better-toml"
vscode "tomoki1207.pdf"
vscode "unifiedjs.vscode-mdx"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vmware.vscode-boot-dev-pack"
vscode "vmware.vscode-spring-boot"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscjava.vscode-spring-boot-dashboard"
vscode "vscjava.vscode-spring-initializr"
vscode "whizkydee.material-palenight-theme"
vscode "wicked-labs.wvsc-serendipity"
vscode "wix.vscode-import-cost"
vscode "yoavbls.pretty-ts-errors"
vscode "zeno.mihale"
